_posts/programming/2022-05-31-cppcoreguidelines-f21.html
---
layout: post
title: CppCoreGuidelines F.21 如果要返回多个值，可以返回一个结构
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
F.21: To return multiple “ out ” values, prefer returning a struct
</p>

<p>
<b>理由</b>
</p>

<p>
函数结果通过返回值的方式返回，意义明确，代码更容易理解。C++ 里可以用类似 <code>tuple</code> 的类型（包括<code>struct</code>, <code>array</code>, <code>tuple</code>）返回多个值，还可以直接在调用处进行结构绑定（C++17）；最好使用定义了类型名的结构体，这样可以通过成员名能提供语义解释（推荐）。不命名的元组在泛型模板代码中用的比较多。
</p>


<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src-bad src-C++"><span style="color: #3F7F5F;">// BAD: output-only parameter documented in a comment</span>
<span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold;">f1</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">input</span>, <span style="color: #3F7F5F;">/*output only*/</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">output_data</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">status</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #110099;">1</span>;
    <span style="color: #000000;">output_data</span> <span style="color: #7F0055; font-weight: bold;">=</span> input <span style="color: #7F0055; font-weight: bold;">+</span> <span style="color: #2A00FF;">" hello"</span>;
    <span style="color: #7F0055; font-weight: bold;">return</span> status;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold;">main</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #000000;">ss</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">string</span><span style="color: #7388d6;">()</span>;
    <span style="color: #7F0055; font-weight: bold;">if</span><span style="color: #7388d6;">(</span><span style="color: #3a5fcd; font-weight: bold;">f1</span><span style="color: #909183;">(</span><span style="color: #2A00FF;">"bonjour,"</span>, ss<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> ss <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> endl;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
bonjour, hello
</pre>


<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #3F7F5F;">// GOOD: self-documenting</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">tuple</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">int</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">f2</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">input</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">status</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #110099;">1</span>;
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">make_tuple</span><span style="color: #7388d6;">(</span>status, input <span style="color: #7F0055; font-weight: bold;">+</span> <span style="color: #2A00FF;">" hello"</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold;">main</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #000000;">tt</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">f2</span><span style="color: #7388d6;">(</span><span style="color: #2A00FF;">"bonjour,"</span><span style="color: #7388d6;">)</span>;
    <span style="color: #7F0055; font-weight: bold;">if</span><span style="color: #7388d6;">(</span><span style="color: #3a5fcd; font-weight: bold;">get</span><span style="color: #909183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #909183; font-weight: bold;">&gt;</span><span style="color: #909183;">(</span>tt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> <span style="color: #3a5fcd; font-weight: bold;">get</span><span style="color: #909183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #909183; font-weight: bold;">&gt;</span><span style="color: #909183;">(</span>tt<span style="color: #909183;">)</span> <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> endl;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
bonjour, hello
</pre>


<p>
C++98 标准库就已经在用这个方法返回值。比如下面代码中， <code>pair</code> 其实就是有两个元素的 <code>tuple</code> ：
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #3F7F5F;">// C++98</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">set</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #000000;">my_set</span>;
<span style="color: #000000; font-style: italic; text-decoration: underline;">pair</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">set</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7388d6; font-weight: bold;">&gt;</span>::<span style="color: #000000; font-style: italic; text-decoration: underline;">iterator</span>, <span style="color: #7F0055; font-weight: bold;">bool</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #000000;">result</span> <span style="color: #7F0055; font-weight: bold;">=</span> my_set.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">insert</span><span style="color: #707183;">(</span><span style="color: #2A00FF;">"Hello"</span><span style="color: #707183;">)</span>;
<span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #707183;">(</span>result.<span style="color: #110099; font-style: italic;">second</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> result.<span style="color: #110099; font-style: italic;">second</span> <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> endl;          <span style="color: #3F7F5F;">//1</span>
    cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> <span style="color: #7F0055; font-weight: bold;">*</span>result.<span style="color: #110099; font-style: italic;">first</span>;                  <span style="color: #3F7F5F;">// workaround</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
1
Hello
</pre>


<p>
在C++11中，可以直接把结果填入多个局部变量：
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">set</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #000000;">my_set</span>;
<span style="color: #000000; font-style: italic; text-decoration: underline;">set</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183; font-weight: bold;">&gt;</span>::<span style="color: #000000; font-style: italic; text-decoration: underline;">iterator</span> <span style="color: #000000;">iter</span>;
<span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">success</span>;

<span style="color: #3a5fcd; font-weight: bold;">tie</span><span style="color: #707183;">(</span>iter, success<span style="color: #707183;">)</span> <span style="color: #7F0055; font-weight: bold;">=</span> my_set.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">insert</span><span style="color: #707183;">(</span><span style="color: #2A00FF;">"Hello"</span><span style="color: #707183;">)</span>;
<span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #707183;">(</span>success<span style="color: #707183;">)</span> cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> <span style="color: #7F0055; font-weight: bold;">*</span>iter;
</pre>
</div>

<pre class="example">
Hello
</pre>


<p>
C++17 支持以“结构绑定”的方式直接初始化多个变量：
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">set</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #000000;">my_set</span>;
<span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #7388d6;">[</span> <span style="color: #000000;">iter</span>, <span style="color: #000000;">success</span> <span style="color: #7388d6;">]</span> <span style="color: #7F0055; font-weight: bold;">=</span> my_set.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">insert</span><span style="color: #7388d6;">(</span><span style="color: #2A00FF;">"Hello"</span><span style="color: #7388d6;">)</span>; success<span style="color: #707183;">)</span>
    cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> <span style="color: #7F0055; font-weight: bold;">*</span>iter;
</pre>
</div>

<pre class="example">
Hello
</pre>


<p>
结构体中的每个变量都有名字，更好理解。比如 <code>ranges::min_max_result</code> ,
<code>from_chars_result</code> 等。
</p>

<p>
<b>例外</b>
</p>

<p>
有时，我们要传一个对象给函数，让函数修改其状态。这时候，最好通过引用
<code>T&amp;</code> 传递对象。通常不需要显式的传一个 in-out 参数做为返回值。
</p>

<p>
例子
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #3F7F5F;">// much like std::operator&gt;&gt;()</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">&gt;&gt;</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">is</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">s</span><span style="color: #707183;">)</span>;

<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>; cin <span style="color: #7F0055; font-weight: bold;">&gt;&gt;</span> s; <span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// do something with line</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
这里， <code>s</code> 和 <code>cin</code> 都是作为输入输出参数传递。以非 <code>const</code> 引用的方式传入
<code>cin</code> ，其状态可以改变。以引用传递 <code>s</code> 是避免重复分配内存资源。只有需要扩展 <code>s</code> 的大小时，分配新内存。这个技术叫做“caller-allocated out”（“调用者分配输出”）模式。适用于 <code>string</code> 和 <code>vector</code> 等类型。
</p>

<p>
对比的，如果全部值都要返回的话，要写成这样：
</p>

<div class="org-src-container">
<pre class="src src-bad src-C++"><span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">get_string_result</span> <span style="color: #707183;">{</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #110099; font-style: italic;">in</span>; <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000; font-style: italic;">s</span>; <span style="color: #707183;">}</span>;

<span style="color: #000000; font-style: italic; text-decoration: underline;">get_string_result</span> <span style="color: #0000ff; font-weight: bold;">get_string</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">in</span><span style="color: #707183;">)</span>  <span style="color: #3F7F5F;">// not recommended</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>;
    in <span style="color: #7F0055; font-weight: bold;">&gt;&gt;</span> s;
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #7388d6;">{</span> in, <span style="color: #3a5fcd; font-weight: bold;">move</span><span style="color: #909183;">(</span>s<span style="color: #909183;">)</span> <span style="color: #7388d6;">}</span>;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #7388d6;">[</span><span style="color: #000000;">in</span>, <span style="color: #000000;">s</span><span style="color: #7388d6;">]</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">get_string</span><span style="color: #7388d6;">(</span>cin<span style="color: #7388d6;">)</span>; in; <span style="color: #000000;">s</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">get_string</span><span style="color: #7388d6;">(</span>in<span style="color: #7388d6;">)</span>.<span style="color: #110099; font-style: italic;">s</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// do something with string</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
我们认为这样很不优雅，性能较差。
</p>


<p>
<b>注意</b>
</p>

<p>
很多情况，返回一个自定义的类型比较有用，比如：
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Distance</span> <span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000; font-style: italic;">value</span>;
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000; font-style: italic;">unit</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #110099;">1</span>;   <span style="color: #3F7F5F;">// 1 means meters</span>
<span style="color: #707183;">}</span>;

<span style="color: #000000; font-style: italic; text-decoration: underline;">Distance</span> <span style="color: #000000;">d1</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">measure</span><span style="color: #707183;">(</span>obj1<span style="color: #707183;">)</span>;        <span style="color: #3F7F5F;">// access d1.value and d1.unit</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #000000;">d2</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">measure</span><span style="color: #707183;">(</span>obj2<span style="color: #707183;">)</span>;            <span style="color: #3F7F5F;">// access d2.value and d2.unit</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #707183;">[</span><span style="color: #000000;">value</span>, <span style="color: #000000;">unit</span><span style="color: #707183;">]</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">measure</span><span style="color: #707183;">(</span>obj3<span style="color: #707183;">)</span>; <span style="color: #3F7F5F;">// access value and unit; somewhat redundant</span>
                                    <span style="color: #3F7F5F;">// to people who know measure()</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">auto</span> <span style="color: #707183;">[</span><span style="color: #000000;">x</span>, <span style="color: #000000;">y</span><span style="color: #707183;">]</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">measure</span><span style="color: #707183;">(</span>obj4<span style="color: #707183;">)</span>;        <span style="color: #3F7F5F;">// don't; it's likely to be confusing</span>
</pre>
</div>

<p>
当返回值是互相独立的数据实体的时候，可以用极度泛型的 <code>pair</code> 和 <code>tuple</code> 解构返回值。但不要用于封装得很好的抽象实体。
</p>

<p>
另外，也可以用<code>optional&lt;T&gt;</code>或 <code>expected&lt;T, error_code&gt;</code> 来返回可能不同的类型值。尽量避免用 <code>pair</code> 和 <code>tuple</code> 。像<code>pair&lt;T, bool&gt;</code>和 <code>pair&lt;T,
error_code&gt;</code> 这种类型描述不够直观。
</p>


<p>
<b>注意</b>
</p>

<p>
如果从局部组成的对象太大，不适合复制，可以考虑显式的 <code>move</code> 移动操作，从而避免产生复制。
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">pair</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">LargeObject</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">LargeObject</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">f</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">input</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">LargeObject</span> <span style="color: #000000;">large1</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">g</span><span style="color: #7388d6;">(</span>input<span style="color: #7388d6;">)</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">LargeObject</span> <span style="color: #000000;">large2</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">h</span><span style="color: #7388d6;">(</span>input<span style="color: #7388d6;">)</span>;
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #7388d6;">{</span> <span style="color: #3a5fcd; font-weight: bold;">move</span><span style="color: #909183;">(</span>large1<span style="color: #909183;">)</span>, <span style="color: #3a5fcd; font-weight: bold;">move</span><span style="color: #909183;">(</span>large2<span style="color: #909183;">)</span> <span style="color: #7388d6;">}</span>; <span style="color: #3F7F5F;">// no copies</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
也可以这样写：
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">pair</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">LargeObject</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">LargeObject</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">f</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">input</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #7388d6;">{</span> <span style="color: #3a5fcd; font-weight: bold;">g</span><span style="color: #909183;">(</span>input<span style="color: #909183;">)</span>, <span style="color: #3a5fcd; font-weight: bold;">h</span><span style="color: #909183;">(</span>input<span style="color: #909183;">)</span> <span style="color: #7388d6;">}</span>; <span style="color: #3F7F5F;">// no copies, no moves</span>
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
<b>强化</b>
</p>
<ul class="org-ul">
<li>用返回值替换出参。出参指的是： 1 ）函数会改写； 2 ）函数修改参数的成员变量，且变量不是常量； 3 ）以非 <code>const</code> 的形式传入。</li>
<li>用结构体作为返回值类型，不要用 <code>pair</code> 或 <code>tuple</code> 。不过在泛型模板中，
<code>tuple</code> 可能无法避免。</li>
</ul>
